In [0]:
--COMPLEX SQL QUERIES--
--1.Find out max and min salary per dept and add this as column --
create table employee
(
	id 			int,
	name 		varchar(100),
	dept 		varchar(100),
	salary 		int
);
insert into employee values(1, 'Alexander', 'Admin', 6500);
insert into employee values(2, 'Leo', 'Finance', 7000);
insert into employee values(3, 'Robin', 'IT', 2000);    
insert into employee values(4, 'Ali', 'IT', 4000);
insert into employee values(5, 'Maria', 'IT', 6000);
insert into employee values(6, 'Alice', 'Admin', 5000);
insert into employee values(7, 'Sebastian', 'HR', 3000);
insert into employee values(8, 'Emma', 'Finance', 4000);
insert into employee values(9, 'John', 'HR', 4500);
insert into employee values(10, 'Kabir', 'IT', 8000);

--Solution--
select *,max(salary)over(partition by dept order by id)as highest_salary
        ,min(salary)over(partition by dept order by id range between unbounded preceding and unbounded following)as lowest_salary
from employee;

In [0]:
--2.Find and remove the duplicate records--
create table cars
(
	model_id		int,
	model_name		varchar(100),
	color			varchar(100),
	brand			varchar(100)
);
insert into cars values(1,'Leaf', 'Black', 'Nissan');
insert into cars values(2,'Leaf', 'Black', 'Nissan');
insert into cars values(3,'Model S', 'Black', 'Tesla');
insert into cars values(4,'Model X', 'White', 'Tesla');
insert into cars values(5,'Ioniq 5', 'Black', 'Hyundai');
insert into cars values(6,'Ioniq 5', 'Black', 'Hyundai');
insert into cars values(7,'Ioniq 6', 'White', 'Hyundai');

--solution-
delete from cars where model_id in (select model_id from (select *,row_number()over(partition by model_name,color order by model_id)as rn from cars)as x where x.rn>1);

In [0]:
--3.Write the sql query that every team is playing a single or a double match with every other team--
create table IPL
    (
        team_code       varchar(10),
        team_name       varchar(40)
    );

insert into IPL values ('RCB', 'Royal Challengers Bangalore');
insert into IPL values ('MI', 'Mumbai Indians');
insert into IPL values ('CSK', 'Chennai Super Kings');
insert into IPL values ('DC', 'Delhi Capitals');
insert into IPL values ('RR', 'Rajasthan Royals');
insert into IPL values ('SRH', 'Sunrisers Hyderbad');
insert into IPL values ('PBKS', 'Punjab Kings');
insert into IPL values ('KKR', 'Kolkata Knight Riders');
insert into IPL values ('GT', 'Gujarat Titans');
insert into IPL values ('LSG', 'Lucknow Super Giants');

--solution1-
with matches as (select team_name,row_number()over(order by team_name)as rn from IPL)
select team.team_name as team,opponent.team_name as opponent
from matches team
join matches opponent
on team.rn<opponent.rn
order by team;

--Solution2--
with matches as (select team_name,row_number()over(order by team_name)as rn from IPL)
select team.team_name as team,opponent.team_name as opponent
from matches team
join matches opponent
on team.rn<>opponent.rn
order by team;

In [0]:
--4.Remove the redundant data--
create table travel
(
    source          varchar(20),
    destination     varchar(20),
    distance        int
);
insert into travel values ('Bangalore', 'Hyderbad', 400);
insert into travel values ('Hyderbad', 'Bangalore', 400);
insert into travel values ('Mumbai', 'Delhi', 400);
insert into travel values ('Delhi', 'Mumbai', 400);
insert into travel values ('Chennai', 'Pune', 400);
insert into travel values ('Pune', 'Chennai', 400);

--Solution--
with cte as (select *,row_number()over(order by source)as rn from travel)
select t1.source,t1.destination,t1.distance
from cte t1
join cte t2
on t1.rn<t2.rn
and t1.source=t2.destination
and t1.destination=t2.source
order by source;

In [0]:
--5.Find out actual distance travelled by a car in each day--
create table car_travels
(
    cars                    varchar(40),
    days                    varchar(10),
    cumulative_distance     int
);
insert into car_travels values ('Car1', 'Day1', 50);
insert into car_travels values ('Car1', 'Day2', 100);
insert into car_travels values ('Car1', 'Day3', 200);
insert into car_travels values ('Car2', 'Day1', 0);
insert into car_travels values ('Car3', 'Day1', 0);
insert into car_travels values ('Car3', 'Day2', 50);
insert into car_travels values ('Car3', 'Day3', 50);
insert into car_travels values ('Car3', 'Day4', 100);

--Solution---
select *,cumulative_distance-lag(cumulative_distance,1,0)over(partition by cars order by days)as actual_distance_travelled from car_travels;